ir_version: 6
producer_name: "pytorch"
producer_version: "1.7"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "1211"
    output: "492"
    name: "ConstantOfShape_0"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1212"
    input: "492"
    output: "493"
    name: "Concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "494"
    name: "Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "493"
    input: "494"
    output: "495"
    name: "Reshape_3"
    op_type: "Reshape"
  }
  node {
    output: "496"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "497"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "498"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "499"
    name: "Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "495"
    input: "497"
    input: "498"
    input: "496"
    input: "499"
    output: "500"
    name: "Slice_8"
    op_type: "Slice"
  }
  node {
    input: "500"
    output: "501"
    name: "Transpose_9"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "502"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "501"
    input: "502"
    output: "503"
    name: "Reshape_11"
    op_type: "Reshape"
  }
  node {
    input: "503"
    output: "504"
    name: "Cast_12"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "505"
    name: "Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    input: "504"
    input: "505"
    output: "506"
    name: "Pad_14"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "constant"
      type: STRING
    }
  }
  node {
    input: "506"
    input: "993"
    input: "994"
    output: "992"
    name: "Conv_15"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "509"
    name: "Constant_16"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "510"
    name: "Constant_17"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "992"
    input: "509"
    input: "510"
    output: "511"
    name: "Clip_18"
    op_type: "Clip"
  }
  node {
    input: "511"
    input: "996"
    input: "997"
    output: "995"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 32
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "514"
    name: "Constant_20"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "515"
    name: "Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "995"
    input: "514"
    input: "515"
    output: "516"
    name: "Clip_22"
    op_type: "Clip"
  }
  node {
    input: "516"
    input: "999"
    input: "1000"
    output: "998"
    name: "Conv_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "998"
    input: "1002"
    input: "1003"
    output: "1001"
    name: "Conv_24"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "521"
    name: "Constant_25"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "522"
    name: "Constant_26"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1001"
    input: "521"
    input: "522"
    output: "523"
    name: "Clip_27"
    op_type: "Clip"
  }
  node {
    input: "1216"
    output: "533"
    name: "ConstantOfShape_28"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1217"
    input: "533"
    output: "534"
    name: "Concat_29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "535"
    name: "Constant_30"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "534"
    input: "535"
    output: "536"
    name: "Reshape_31"
    op_type: "Reshape"
  }
  node {
    output: "537"
    name: "Constant_32"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "538"
    name: "Constant_33"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "539"
    name: "Constant_34"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "540"
    name: "Constant_35"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "536"
    input: "538"
    input: "539"
    input: "537"
    input: "540"
    output: "541"
    name: "Slice_36"
    op_type: "Slice"
  }
  node {
    input: "541"
    output: "542"
    name: "Transpose_37"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "543"
    name: "Constant_38"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "542"
    input: "543"
    output: "544"
    name: "Reshape_39"
    op_type: "Reshape"
  }
  node {
    input: "544"
    output: "545"
    name: "Cast_40"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "546"
    name: "Constant_41"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "523"
    input: "545"
    input: "546"
    output: "547"
    name: "Pad_42"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "constant"
      type: STRING
    }
  }
  node {
    input: "547"
    input: "1005"
    input: "1006"
    output: "1004"
    name: "Conv_43"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 144
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "550"
    name: "Constant_44"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "551"
    name: "Constant_45"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1004"
    input: "550"
    input: "551"
    output: "552"
    name: "Clip_46"
    op_type: "Clip"
  }
  node {
    input: "552"
    input: "1008"
    input: "1009"
    output: "1007"
    name: "Conv_47"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1007"
    input: "1011"
    input: "1012"
    output: "1010"
    name: "Conv_48"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "557"
    name: "Constant_49"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "558"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1010"
    input: "557"
    input: "558"
    output: "559"
    name: "Clip_51"
    op_type: "Clip"
  }
  node {
    input: "559"
    input: "1014"
    input: "1015"
    output: "1013"
    name: "Conv_52"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "562"
    name: "Constant_53"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "563"
    name: "Constant_54"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1013"
    input: "562"
    input: "563"
    output: "564"
    name: "Clip_55"
    op_type: "Clip"
  }
  node {
    input: "564"
    input: "1017"
    input: "1018"
    output: "1016"
    name: "Conv_56"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1016"
    input: "1007"
    output: "567"
    name: "Add_57"
    op_type: "Add"
  }
  node {
    input: "567"
    input: "1020"
    input: "1021"
    output: "1019"
    name: "Conv_58"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "570"
    name: "Constant_59"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "571"
    name: "Constant_60"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1019"
    input: "570"
    input: "571"
    output: "572"
    name: "Clip_61"
    op_type: "Clip"
  }
  node {
    input: "572"
    input: "1023"
    input: "1024"
    output: "1022"
    name: "Conv_62"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "575"
    name: "Constant_63"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "576"
    name: "Constant_64"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1022"
    input: "575"
    input: "576"
    output: "577"
    name: "Clip_65"
    op_type: "Clip"
  }
  node {
    input: "577"
    input: "1026"
    input: "1027"
    output: "1025"
    name: "Conv_66"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1025"
    input: "567"
    output: "580"
    name: "Add_67"
    op_type: "Add"
  }
  node {
    input: "580"
    input: "1029"
    input: "1030"
    output: "1028"
    name: "Conv_68"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "583"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "584"
    name: "Constant_70"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1028"
    input: "583"
    input: "584"
    output: "585"
    name: "Clip_71"
    op_type: "Clip"
  }
  node {
    input: "1221"
    output: "595"
    name: "ConstantOfShape_72"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1222"
    input: "595"
    output: "596"
    name: "Concat_73"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "597"
    name: "Constant_74"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "596"
    input: "597"
    output: "598"
    name: "Reshape_75"
    op_type: "Reshape"
  }
  node {
    output: "599"
    name: "Constant_76"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "600"
    name: "Constant_77"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "601"
    name: "Constant_78"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "602"
    name: "Constant_79"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "598"
    input: "600"
    input: "601"
    input: "599"
    input: "602"
    output: "603"
    name: "Slice_80"
    op_type: "Slice"
  }
  node {
    input: "603"
    output: "604"
    name: "Transpose_81"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "605"
    name: "Constant_82"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "604"
    input: "605"
    output: "606"
    name: "Reshape_83"
    op_type: "Reshape"
  }
  node {
    input: "606"
    output: "607"
    name: "Cast_84"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "608"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "585"
    input: "607"
    input: "608"
    output: "609"
    name: "Pad_86"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "constant"
      type: STRING
    }
  }
  node {
    input: "609"
    input: "1032"
    input: "1033"
    output: "1031"
    name: "Conv_87"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 192
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "612"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "613"
    name: "Constant_89"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1031"
    input: "612"
    input: "613"
    output: "614"
    name: "Clip_90"
    op_type: "Clip"
  }
  node {
    input: "614"
    input: "1035"
    input: "1036"
    output: "1034"
    name: "Conv_91"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1034"
    input: "1038"
    input: "1039"
    output: "1037"
    name: "Conv_92"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "619"
    name: "Constant_93"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "620"
    name: "Constant_94"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1037"
    input: "619"
    input: "620"
    output: "621"
    name: "Clip_95"
    op_type: "Clip"
  }
  node {
    input: "621"
    input: "1041"
    input: "1042"
    output: "1040"
    name: "Conv_96"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 288
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "624"
    name: "Constant_97"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "625"
    name: "Constant_98"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1040"
    input: "624"
    input: "625"
    output: "626"
    name: "Clip_99"
    op_type: "Clip"
  }
  node {
    input: "626"
    input: "1044"
    input: "1045"
    output: "1043"
    name: "Conv_100"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1043"
    input: "1034"
    output: "629"
    name: "Add_101"
    op_type: "Add"
  }
  node {
    input: "629"
    input: "1047"
    input: "1048"
    output: "1046"
    name: "Conv_102"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "632"
    name: "Constant_103"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "633"
    name: "Constant_104"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1046"
    input: "632"
    input: "633"
    output: "634"
    name: "Clip_105"
    op_type: "Clip"
  }
  node {
    input: "634"
    input: "1050"
    input: "1051"
    output: "1049"
    name: "Conv_106"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 288
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "637"
    name: "Constant_107"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "638"
    name: "Constant_108"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1049"
    input: "637"
    input: "638"
    output: "639"
    name: "Clip_109"
    op_type: "Clip"
  }
  node {
    input: "639"
    input: "1053"
    input: "1054"
    output: "1052"
    name: "Conv_110"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1052"
    input: "629"
    output: "642"
    name: "Add_111"
    op_type: "Add"
  }
  node {
    input: "642"
    input: "1056"
    input: "1057"
    output: "1055"
    name: "Conv_112"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "645"
    name: "Constant_113"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "646"
    name: "Constant_114"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1055"
    input: "645"
    input: "646"
    output: "647"
    name: "Clip_115"
    op_type: "Clip"
  }
  node {
    input: "1226"
    output: "657"
    name: "ConstantOfShape_116"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "1227"
    input: "657"
    output: "658"
    name: "Concat_117"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "659"
    name: "Constant_118"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "658"
    input: "659"
    output: "660"
    name: "Reshape_119"
    op_type: "Reshape"
  }
  node {
    output: "661"
    name: "Constant_120"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "662"
    name: "Constant_121"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "663"
    name: "Constant_122"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "664"
    name: "Constant_123"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "660"
    input: "662"
    input: "663"
    input: "661"
    input: "664"
    output: "665"
    name: "Slice_124"
    op_type: "Slice"
  }
  node {
    input: "665"
    output: "666"
    name: "Transpose_125"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "667"
    name: "Constant_126"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "666"
    input: "667"
    output: "668"
    name: "Reshape_127"
    op_type: "Reshape"
  }
  node {
    input: "668"
    output: "669"
    name: "Cast_128"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    output: "670"
    name: "Constant_129"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "647"
    input: "669"
    input: "670"
    output: "671"
    name: "Pad_130"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "constant"
      type: STRING
    }
  }
  node {
    input: "671"
    input: "1059"
    input: "1060"
    output: "1058"
    name: "Conv_131"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 288
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "674"
    name: "Constant_132"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "675"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1058"
    input: "674"
    input: "675"
    output: "676"
    name: "Clip_134"
    op_type: "Clip"
  }
  node {
    input: "676"
    input: "1062"
    input: "1063"
    output: "1061"
    name: "Conv_135"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1061"
    input: "1065"
    input: "1066"
    output: "1064"
    name: "Conv_136"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "681"
    name: "Constant_137"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "682"
    name: "Constant_138"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1064"
    input: "681"
    input: "682"
    output: "683"
    name: "Clip_139"
    op_type: "Clip"
  }
  node {
    input: "683"
    input: "1068"
    input: "1069"
    output: "1067"
    name: "Conv_140"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "686"
    name: "Constant_141"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "687"
    name: "Constant_142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1067"
    input: "686"
    input: "687"
    output: "688"
    name: "Clip_143"
    op_type: "Clip"
  }
  node {
    input: "688"
    input: "1071"
    input: "1072"
    output: "1070"
    name: "Conv_144"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1070"
    input: "1061"
    output: "691"
    name: "Add_145"
    op_type: "Add"
  }
  node {
    input: "691"
    input: "1074"
    input: "1075"
    output: "1073"
    name: "Conv_146"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "694"
    name: "Constant_147"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "695"
    name: "Constant_148"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1073"
    input: "694"
    input: "695"
    output: "696"
    name: "Clip_149"
    op_type: "Clip"
  }
  node {
    input: "696"
    input: "1077"
    input: "1078"
    output: "1076"
    name: "Conv_150"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "699"
    name: "Constant_151"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "700"
    name: "Constant_152"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1076"
    input: "699"
    input: "700"
    output: "701"
    name: "Clip_153"
    op_type: "Clip"
  }
  node {
    input: "701"
    input: "1080"
    input: "1081"
    output: "1079"
    name: "Conv_154"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1079"
    input: "691"
    output: "704"
    name: "Add_155"
    op_type: "Add"
  }
  node {
    input: "704"
    input: "1083"
    input: "1084"
    output: "1082"
    name: "Conv_156"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "707"
    name: "Constant_157"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "708"
    name: "Constant_158"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1082"
    input: "707"
    input: "708"
    output: "709"
    name: "Clip_159"
    op_type: "Clip"
  }
  node {
    input: "709"
    input: "1086"
    input: "1087"
    output: "1085"
    name: "Conv_160"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "712"
    name: "Constant_161"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "713"
    name: "Constant_162"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1085"
    input: "712"
    input: "713"
    output: "714"
    name: "Clip_163"
    op_type: "Clip"
  }
  node {
    input: "714"
    input: "1089"
    input: "1090"
    output: "1088"
    name: "Conv_164"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1088"
    input: "704"
    output: "717"
    name: "Add_165"
    op_type: "Add"
  }
  node {
    input: "717"
    input: "1092"
    input: "1093"
    output: "1091"
    name: "Conv_166"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "720"
    name: "Constant_167"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "721"
    name: "Constant_168"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1091"
    input: "720"
    input: "721"
    output: "722"
    name: "Clip_169"
    op_type: "Clip"
  }
  node {
    input: "722"
    input: "1095"
    input: "1096"
    output: "1094"
    name: "Conv_170"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "725"
    name: "Constant_171"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "726"
    name: "Constant_172"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1094"
    input: "725"
    input: "726"
    output: "727"
    name: "Clip_173"
    op_type: "Clip"
  }
  node {
    input: "727"
    input: "1098"
    input: "1099"
    output: "1097"
    name: "Conv_174"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "1097"
    input: "717"
    output: "730"
    name: "Add_175"
    op_type: "Add"
  }
  node {
    input: "730"
    input: "1101"
    input: "1102"
    output: "1100"
    name: "Conv_176"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "733"
    name: "Constant_177"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "734"
    name: "Constant_178"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1100"
    input: "733"
    input: "734"
    output: "735"
    name: "Clip_179"
    op_type: "Clip"
  }
  node {
    input: "735"
    input: "1104"
    input: "1105"
    output: "1103"
    name: "Conv_180"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 576
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "738"
    name: "Constant_181"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "739"
    name: "Constant_182"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "1103"
    input: "738"
    input: "739"
    output: "740"
    name: "Clip_183"
    op_type: "Clip"
  }
  node {
    input: "740"
    input: "1107"
    input: "1108"
    output: "1106"
    name: "Conv_184"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
