ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "input.1"
    input: "stage1.rebnconvin.conv_s1.weight"
    input: "stage1.rebnconvin.conv_s1.bias"
    output: "799"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "799"
    input: "stage1.rebnconvin.bn_s1.weight"
    input: "stage1.rebnconvin.bn_s1.bias"
    input: "stage1.rebnconvin.bn_s1.running_mean"
    input: "stage1.rebnconvin.bn_s1.running_var"
    output: "800"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "800"
    output: "801"
    name: "Relu_2"
    op_type: "Relu"
  }
  node {
    input: "801"
    input: "stage1.rebnconv1.conv_s1.weight"
    input: "stage1.rebnconv1.conv_s1.bias"
    output: "802"
    name: "Conv_3"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "802"
    input: "stage1.rebnconv1.bn_s1.weight"
    input: "stage1.rebnconv1.bn_s1.bias"
    input: "stage1.rebnconv1.bn_s1.running_mean"
    input: "stage1.rebnconv1.bn_s1.running_var"
    output: "803"
    name: "BatchNormalization_4"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "803"
    output: "804"
    name: "Relu_5"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "805"
    name: "MaxPool_6"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "805"
    input: "stage1.rebnconv2.conv_s1.weight"
    input: "stage1.rebnconv2.conv_s1.bias"
    output: "806"
    name: "Conv_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "806"
    input: "stage1.rebnconv2.bn_s1.weight"
    input: "stage1.rebnconv2.bn_s1.bias"
    input: "stage1.rebnconv2.bn_s1.running_mean"
    input: "stage1.rebnconv2.bn_s1.running_var"
    output: "807"
    name: "BatchNormalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "807"
    output: "808"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "809"
    name: "MaxPool_10"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "809"
    input: "stage1.rebnconv3.conv_s1.weight"
    input: "stage1.rebnconv3.conv_s1.bias"
    output: "810"
    name: "Conv_11"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "810"
    input: "stage1.rebnconv3.bn_s1.weight"
    input: "stage1.rebnconv3.bn_s1.bias"
    input: "stage1.rebnconv3.bn_s1.running_mean"
    input: "stage1.rebnconv3.bn_s1.running_var"
    output: "811"
    name: "BatchNormalization_12"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "811"
    output: "812"
    name: "Relu_13"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "813"
    name: "MaxPool_14"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "813"
    input: "stage1.rebnconv4.conv_s1.weight"
    input: "stage1.rebnconv4.conv_s1.bias"
    output: "814"
    name: "Conv_15"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "814"
    input: "stage1.rebnconv4.bn_s1.weight"
    input: "stage1.rebnconv4.bn_s1.bias"
    input: "stage1.rebnconv4.bn_s1.running_mean"
    input: "stage1.rebnconv4.bn_s1.running_var"
    output: "815"
    name: "BatchNormalization_16"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "815"
    output: "816"
    name: "Relu_17"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "817"
    name: "MaxPool_18"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "817"
    input: "stage1.rebnconv5.conv_s1.weight"
    input: "stage1.rebnconv5.conv_s1.bias"
    output: "818"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "818"
    input: "stage1.rebnconv5.bn_s1.weight"
    input: "stage1.rebnconv5.bn_s1.bias"
    input: "stage1.rebnconv5.bn_s1.running_mean"
    input: "stage1.rebnconv5.bn_s1.running_var"
    output: "819"
    name: "BatchNormalization_20"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "819"
    output: "820"
    name: "Relu_21"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "821"
    name: "MaxPool_22"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "821"
    input: "stage1.rebnconv6.conv_s1.weight"
    input: "stage1.rebnconv6.conv_s1.bias"
    output: "822"
    name: "Conv_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "822"
    input: "stage1.rebnconv6.bn_s1.weight"
    input: "stage1.rebnconv6.bn_s1.bias"
    input: "stage1.rebnconv6.bn_s1.running_mean"
    input: "stage1.rebnconv6.bn_s1.running_var"
    output: "823"
    name: "BatchNormalization_24"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "823"
    output: "824"
    name: "Relu_25"
    op_type: "Relu"
  }
  node {
    input: "824"
    input: "stage1.rebnconv7.conv_s1.weight"
    input: "stage1.rebnconv7.conv_s1.bias"
    output: "825"
    name: "Conv_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "825"
    input: "stage1.rebnconv7.bn_s1.weight"
    input: "stage1.rebnconv7.bn_s1.bias"
    input: "stage1.rebnconv7.bn_s1.running_mean"
    input: "stage1.rebnconv7.bn_s1.running_var"
    output: "826"
    name: "BatchNormalization_27"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "826"
    output: "827"
    name: "Relu_28"
    op_type: "Relu"
  }
  node {
    input: "827"
    input: "824"
    output: "828"
    name: "Concat_29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "828"
    input: "stage1.rebnconv6d.conv_s1.weight"
    input: "stage1.rebnconv6d.conv_s1.bias"
    output: "829"
    name: "Conv_30"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "829"
    input: "stage1.rebnconv6d.bn_s1.weight"
    input: "stage1.rebnconv6d.bn_s1.bias"
    input: "stage1.rebnconv6d.bn_s1.running_mean"
    input: "stage1.rebnconv6d.bn_s1.running_var"
    output: "830"
    name: "BatchNormalization_31"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "830"
    output: "831"
    name: "Relu_32"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "832"
    name: "Shape_33"
    op_type: "Shape"
  }
  node {
    output: "833"
    name: "Constant_34"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "832"
    input: "833"
    output: "834"
    name: "Gather_35"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "820"
    output: "835"
    name: "Shape_36"
    op_type: "Shape"
  }
  node {
    output: "836"
    name: "Constant_37"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "835"
    input: "836"
    output: "837"
    name: "Gather_38"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "834"
    output: "838"
    name: "Unsqueeze_39"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "837"
    output: "839"
    name: "Unsqueeze_40"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "838"
    input: "839"
    output: "840"
    name: "Concat_41"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "841"
    name: "Constant_42"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "831"
    output: "842"
    name: "Shape_43"
    op_type: "Shape"
  }
  node {
    output: "843"
    name: "Constant_44"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "844"
    name: "Constant_45"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "845"
    name: "Constant_46"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "842"
    input: "844"
    input: "845"
    input: "843"
    output: "846"
    name: "Slice_47"
    op_type: "Slice"
  }
  node {
    input: "840"
    output: "847"
    name: "Cast_48"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "846"
    input: "847"
    output: "848"
    name: "Concat_49"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "849"
    name: "Constant_50"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "831"
    input: "841"
    input: "849"
    input: "848"
    output: "850"
    name: "Resize_51"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "850"
    input: "820"
    output: "851"
    name: "Concat_52"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "851"
    input: "stage1.rebnconv5d.conv_s1.weight"
    input: "stage1.rebnconv5d.conv_s1.bias"
    output: "852"
    name: "Conv_53"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "852"
    input: "stage1.rebnconv5d.bn_s1.weight"
    input: "stage1.rebnconv5d.bn_s1.bias"
    input: "stage1.rebnconv5d.bn_s1.running_mean"
    input: "stage1.rebnconv5d.bn_s1.running_var"
    output: "853"
    name: "BatchNormalization_54"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "853"
    output: "854"
    name: "Relu_55"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "855"
    name: "Shape_56"
    op_type: "Shape"
  }
  node {
    output: "856"
    name: "Constant_57"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "855"
    input: "856"
    output: "857"
    name: "Gather_58"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "816"
    output: "858"
    name: "Shape_59"
    op_type: "Shape"
  }
  node {
    output: "859"
    name: "Constant_60"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "858"
    input: "859"
    output: "860"
    name: "Gather_61"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "857"
    output: "861"
    name: "Unsqueeze_62"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "860"
    output: "862"
    name: "Unsqueeze_63"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "861"
    input: "862"
    output: "863"
    name: "Concat_64"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "864"
    name: "Constant_65"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "854"
    output: "865"
    name: "Shape_66"
    op_type: "Shape"
  }
  node {
    output: "866"
    name: "Constant_67"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "867"
    name: "Constant_68"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "868"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "865"
    input: "867"
    input: "868"
    input: "866"
    output: "869"
    name: "Slice_70"
    op_type: "Slice"
  }
  node {
    input: "863"
    output: "870"
    name: "Cast_71"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "869"
    input: "870"
    output: "871"
    name: "Concat_72"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "872"
    name: "Constant_73"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "854"
    input: "864"
    input: "872"
    input: "871"
    output: "873"
    name: "Resize_74"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "873"
    input: "816"
    output: "874"
    name: "Concat_75"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "874"
    input: "stage1.rebnconv4d.conv_s1.weight"
    input: "stage1.rebnconv4d.conv_s1.bias"
    output: "875"
    name: "Conv_76"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "875"
    input: "stage1.rebnconv4d.bn_s1.weight"
    input: "stage1.rebnconv4d.bn_s1.bias"
    input: "stage1.rebnconv4d.bn_s1.running_mean"
    input: "stage1.rebnconv4d.bn_s1.running_var"
    output: "876"
    name: "BatchNormalization_77"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "876"
    output: "877"
    name: "Relu_78"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "878"
    name: "Shape_79"
    op_type: "Shape"
  }
  node {
    output: "879"
    name: "Constant_80"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "878"
    input: "879"
    output: "880"
    name: "Gather_81"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "812"
    output: "881"
    name: "Shape_82"
    op_type: "Shape"
  }
  node {
    output: "882"
    name: "Constant_83"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "881"
    input: "882"
    output: "883"
    name: "Gather_84"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "880"
    output: "884"
    name: "Unsqueeze_85"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "883"
    output: "885"
    name: "Unsqueeze_86"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "884"
    input: "885"
    output: "886"
    name: "Concat_87"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "887"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "877"
    output: "888"
    name: "Shape_89"
    op_type: "Shape"
  }
  node {
    output: "889"
    name: "Constant_90"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "890"
    name: "Constant_91"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "891"
    name: "Constant_92"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "888"
    input: "890"
    input: "891"
    input: "889"
    output: "892"
    name: "Slice_93"
    op_type: "Slice"
  }
  node {
    input: "886"
    output: "893"
    name: "Cast_94"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "892"
    input: "893"
    output: "894"
    name: "Concat_95"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "895"
    name: "Constant_96"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "877"
    input: "887"
    input: "895"
    input: "894"
    output: "896"
    name: "Resize_97"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "896"
    input: "812"
    output: "897"
    name: "Concat_98"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "897"
    input: "stage1.rebnconv3d.conv_s1.weight"
    input: "stage1.rebnconv3d.conv_s1.bias"
    output: "898"
    name: "Conv_99"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "898"
    input: "stage1.rebnconv3d.bn_s1.weight"
    input: "stage1.rebnconv3d.bn_s1.bias"
    input: "stage1.rebnconv3d.bn_s1.running_mean"
    input: "stage1.rebnconv3d.bn_s1.running_var"
    output: "899"
    name: "BatchNormalization_100"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "899"
    output: "900"
    name: "Relu_101"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "901"
    name: "Shape_102"
    op_type: "Shape"
  }
  node {
    output: "902"
    name: "Constant_103"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "901"
    input: "902"
    output: "903"
    name: "Gather_104"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "808"
    output: "904"
    name: "Shape_105"
    op_type: "Shape"
  }
  node {
    output: "905"
    name: "Constant_106"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "904"
    input: "905"
    output: "906"
    name: "Gather_107"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "903"
    output: "907"
    name: "Unsqueeze_108"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "906"
    output: "908"
    name: "Unsqueeze_109"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "907"
    input: "908"
    output: "909"
    name: "Concat_110"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "910"
    name: "Constant_111"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "900"
    output: "911"
    name: "Shape_112"
    op_type: "Shape"
  }
  node {
    output: "912"
    name: "Constant_113"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "913"
    name: "Constant_114"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "914"
    name: "Constant_115"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "911"
    input: "913"
    input: "914"
    input: "912"
    output: "915"
    name: "Slice_116"
    op_type: "Slice"
  }
  node {
    input: "909"
    output: "916"
    name: "Cast_117"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "915"
    input: "916"
    output: "917"
    name: "Concat_118"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "918"
    name: "Constant_119"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "900"
    input: "910"
    input: "918"
    input: "917"
    output: "919"
    name: "Resize_120"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "919"
    input: "808"
    output: "920"
    name: "Concat_121"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "920"
    input: "stage1.rebnconv2d.conv_s1.weight"
    input: "stage1.rebnconv2d.conv_s1.bias"
    output: "921"
    name: "Conv_122"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "921"
    input: "stage1.rebnconv2d.bn_s1.weight"
    input: "stage1.rebnconv2d.bn_s1.bias"
    input: "stage1.rebnconv2d.bn_s1.running_mean"
    input: "stage1.rebnconv2d.bn_s1.running_var"
    output: "922"
    name: "BatchNormalization_123"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "922"
    output: "923"
    name: "Relu_124"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "924"
    name: "Shape_125"
    op_type: "Shape"
  }
  node {
    output: "925"
    name: "Constant_126"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "924"
    input: "925"
    output: "926"
    name: "Gather_127"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "804"
    output: "927"
    name: "Shape_128"
    op_type: "Shape"
  }
  node {
    output: "928"
    name: "Constant_129"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "927"
    input: "928"
    output: "929"
    name: "Gather_130"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "926"
    output: "930"
    name: "Unsqueeze_131"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "929"
    output: "931"
    name: "Unsqueeze_132"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "930"
    input: "931"
    output: "932"
    name: "Concat_133"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "933"
    name: "Constant_134"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "923"
    output: "934"
    name: "Shape_135"
    op_type: "Shape"
  }
  node {
    output: "935"
    name: "Constant_136"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "936"
    name: "Constant_137"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "937"
    name: "Constant_138"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "934"
    input: "936"
    input: "937"
    input: "935"
    output: "938"
    name: "Slice_139"
    op_type: "Slice"
  }
  node {
    input: "932"
    output: "939"
    name: "Cast_140"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "938"
    input: "939"
    output: "940"
    name: "Concat_141"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "941"
    name: "Constant_142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "923"
    input: "933"
    input: "941"
    input: "940"
    output: "942"
    name: "Resize_143"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "pytorch_half_pixel"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
    attribute {
      name: "nearest_mode"
      s: "floor"
      type: STRING
    }
  }
  node {
    input: "942"
    input: "804"
    output: "943"
    name: "Concat_144"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "943"
    input: "stage1.rebnconv1d.conv_s1.weight"
    input: "stage1.rebnconv1d.conv_s1.bias"
    output: "944"
    name: "Conv_145"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "944"
    input: "stage1.rebnconv1d.bn_s1.weight"
    input: "stage1.rebnconv1d.bn_s1.bias"
    input: "stage1.rebnconv1d.bn_s1.running_mean"
    input: "stage1.rebnconv1d.bn_s1.running_var"
    output: "945"
    name: "BatchNormalization_146"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "945"
    output: "946"
    name: "Relu_147"
    op_type: "Relu"
  }
  node {
    input: "946"
    input: "801"
    output: "947"
    name: "Add_148"
    op_type: "Add"
  }
  node {
    input: "947"
    output: "948"
    name: "MaxPool_149"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "948"
    input: "stage2.rebnconvin.conv_s1.weight"
    input: "stage2.rebnconvin.conv_s1.bias"
    output: "949"
    name: "Conv_150"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "949"
    input: "stage2.rebnconvin.bn_s1.weight"
    input: "stage2.rebnconvin.bn_s1.bias"
    input: "stage2.rebnconvin.bn_s1.running_mean"
    input: "stage2.rebnconvin.bn_s1.running_var"
    output: "950"
    name: "BatchNormalization_151"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "950"
    output: "951"
    name: "Relu_152"
    op_type: "Relu"
  }
  node {
    input: "951"
    input: "stage2.rebnconv1.conv_s1.weight"
    input: "stage2.rebnconv1.conv_s1.bias"
    output: "952"
    name: "Conv_153"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "952"
    input: "stage2.rebnconv1.bn_s1.weight"
    input: "stage2.rebnconv1.bn_s1.bias"
    input: "stage2.rebnconv1.bn_s1.running_mean"
    input: "stage2.rebnconv1.bn_s1.running_var"
    output: "953"
    name: "BatchNormalization_154"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "953"
    output: "954"
    name: "Relu_155"
    op_type: "Relu"
  }
  node {
    input: "954"
    output: "955"
    name: "MaxPool_156"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "955"
    input: "stage2.rebnconv2.conv_s1.weight"
    input: "stage2.rebnconv2.conv_s1.bias"
    output: "956"
    name: "Conv_157"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "956"
    input: "stage2.rebnconv2.bn_s1.weight"
    input: "stage2.rebnconv2.bn_s1.bias"
    input: "stage2.rebnconv2.bn_s1.running_mean"
    input: "stage2.rebnconv2.bn_s1.running_var"
    output: "957"
    name: "BatchNormalization_158"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "957"
    output: "958"
    name: "Relu_159"
    op_type: "Relu"
  }
  node {
    input: "958"
    output: "959"
    name: "MaxPool_160"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "959"
    input: "stage2.rebnconv3.conv_s1.weight"
    input: "stage2.rebnconv3.conv_s1.bias"
    output: "960"
    name: "Conv_161"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "960"
    input: "stage2.rebnconv3.bn_s1.weight"
    input: "stage2.rebnconv3.bn_s1.bias"
    input: "stage2.rebnconv3.bn_s1.running_mean"
    input: "stage2.rebnconv3.bn_s1.running_var"
    output: "961"
    name: "BatchNormalization_162"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "961"
    output: "962"
    name: "Relu_163"
    op_type: "Relu"
  }
  node {
    input: "962"
    output: "963"
    name: "MaxPool_164"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "963"
    input: "stage2.rebnconv4.conv_s1.weight"
    input: "stage2.rebnconv4.conv_s1.bias"
    output: "964"
    name: "Conv_165"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "964"
    input: "stage2.rebnconv4.bn_s1.weight"
    input: "stage2.rebnconv4.bn_s1.bias"
    input: "stage2.rebnconv4.bn_s1.running_mean"
    input: "stage2.rebnconv4.bn_s1.running_var"
    output: "965"
    name: "BatchNormalization_166"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "965"
    output: "966"
    name: "Relu_167"
    op_type: "Relu"
  }
  node {
    input: "966"
    output: "967"
    name: "MaxPool_168"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "967"
    input: "stage2.rebnconv5.conv_s1.weight"
    input: "stage2.rebnconv5.conv_s1.bias"
    output: "968"
    name: "Conv_169"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "968"
    input: "stage2.rebnconv5.bn_s1.weight"
    input: "stage2.rebnconv5.bn_s1.bias"
    input: "stage2.rebnconv5.bn_s1.running_mean"
    input: "stage2.rebnconv5.bn_s1.running_var"
    output: "969"
    name: "BatchNormalization_170"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "969"
    output: "970"
    name: "Relu_171"
    op_type: "Relu"
  }
  node {
    input: "970"
    input: "stage2.rebnconv6.conv_s1.weight"
    input: "stage2.rebnconv6.conv_s1.bias"
    output: "971"
    name: "Conv_172"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "971"
    input: "stage2.rebnconv6.bn_s1.weight"
    input: "stage2.rebnconv6.bn_s1.bias"
    input: "stage2.rebnconv6.bn_s1.running_mean"
    input: "stage2.rebnconv6.bn_s1.running_var"
    output: "972"
    name: "BatchNormalization_173"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "972"
    output: "973"
    name: "Relu_174"
    op_type: "Relu"
  }
  node {
    input: "973"
    input: "970"
    output: "974"
    name: "Concat_175"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "974"
    input: "stage2.rebnconv5d.conv_s1.weight"
    input: "stage2.rebnconv5d.conv_s1.bias"
    output: "975"
    name: "Conv_176"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "975"
    input: "stage2.rebnconv5d.bn_s1.weight"
    input: "stage2.rebnconv5d.bn_s1.bias"
    input: "stage2.rebnconv5d.bn_s1.running_mean"
    input: "stage2.rebnconv5d.bn_s1.running_var"
    output: "976"
    name: "BatchNormalization_177"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "976"
    output: "977"
    name: "Relu_178"
    op_type: "Relu"
  }
  node {
    input: "966"
    output: "978"
    name: "Shape_179"
